Revit 2026 API

# MacroLanguageType Enumeration

---

The Macro language types.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MacroLanguageType
```
```vb
Public Enumeration MacroLanguageType
```
```cpp
public enum class MacroLanguageType
```
```fsharp
type MacroLanguageType
```

| Member name | Value | Description |
| --- | --- | --- |
| CSharp | 1 | The C# language. |

#### Reference

Autodesk.Revit.DB.Macros Namespace